In [1]:
import pandas as pd

dframe1 = pd.read_csv('Practical Q8.csv')

In [2]:
dframe1

    Name  Gender  MonthlyIncome (Rs.)
0   Shah    Male               114000
1   Vats    Male                65000
2   Vats  Female                43150
3  Kumar  Female                69500
4   Vats  Female               155000
5  Kumar    Male               103000
6   Shah    Male                55000
7   Shah  Female               112400
8  Kumar  Female                81030
9   Vats    Male                71900

Part a: Calculate and display familywise gross monthly income.

In [3]:
gross_salary = dframe1.groupby('Name').sum()
gross_salary

                     Gender  MonthlyIncome (Rs.)
Name
Kumar      FemaleMaleFemale               253530
Shah         MaleMaleFemale               281400
Vats   MaleFemaleFemaleMale               335050

Part b: Calculate and display the member with the highest monthly income in a family.

In [4]:
highest_income = dframe1.groupby("Name").max()
highest_income

      Gender  MonthlyIncome (Rs.)
Name
Kumar   Male               103000
Shah    Male               114000
Vats    Male               155000

Part c: Calculate and display monthly income of all members with income greater than Rs. 60000.00.

In [5]:
greater_income = dframe1[dframe1['MonthlyIncome (Rs.)'] > 60000.0]
greater_income

    Name  Gender  MonthlyIncome (Rs.)
0   Shah    Male               114000
1   Vats    Male                65000
3  Kumar  Female                69500
4   Vats  Female               155000
5  Kumar    Male               103000
7   Shah  Female               112400
8  Kumar  Female                81030
9   Vats    Male                71900

Part d: Calculate and display the average monthly income of the female members in the Shah family.

In [6]:
average_income = dframe1.groupby(['Name','Gender'], as_index= False).mean()
average_income

    Name  Gender  MonthlyIncome (Rs.)
0  Kumar  Female              75265.0
1  Kumar    Male             103000.0
2   Shah  Female             112400.0
3   Shah    Male              84500.0
4   Vats  Female              99075.0
5   Vats    Male              68450.0

In [7]:
avg_inc = average_income[average_income["Gender"] == "Female"]
avg_inc[avg_inc["Name"] == "Shah"]

   Name  Gender  MonthlyIncome (Rs.)
2  Shah  Female             112400.0